### **ì˜ˆì œ 1: ê²°ì¸¡ì¹˜ ê°œìˆ˜ í™•ì¸ ë° ì²˜ë¦¬**

ğŸ“Œ **ë¬¸ì œ:** `titanic` ë°ì´í„°ë¥¼ ë¶ˆëŸ¬ì™€ì„œ, ê° ì»¬ëŸ¼ë³„ ê²°ì¸¡ì¹˜ ê°œìˆ˜ë¥¼ í™•ì¸í•˜ê³ , `age` ì»¬ëŸ¼ì˜ ê²°ì¸¡ì¹˜ë¥¼ í‰ê· ê°’ìœ¼ë¡œ ì±„ìš°ì‹œì˜¤.

ğŸ’¡ **íŒíŠ¸:** `.isnull().sum()`ì„ ì‚¬ìš©í•˜ë©´ ì»¬ëŸ¼ë³„ ê²°ì¸¡ì¹˜ ê°œìˆ˜ë¥¼ í™•ì¸í•  ìˆ˜ ìˆìŒ.

In [23]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")

print(titanic.isnull().sum()) # .isnull() í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ ê²°ì¸¡ì¹˜ê°€ ìˆëŠ” ê³³ì˜ ê°’ì´ trueë¡œ ë°”ë€œ
# .sum() í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ ê°’ì´ trueì¸ ê²ƒì˜ ê°œìˆ˜ë¥¼ ì¶œë ¥

titanic["age"]=titanic["age"].fillna(titanic["age"].mean())
# .fillna() í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ ê²°ì¸¡ì¹˜ê°€ ìˆëŠ” ë¶€ë¶„ë§Œ íŠ¹ì •í•œ ê°’ìœ¼ë¡œ ì±„ìš¸ ìˆ˜ ìˆ

print(titanic.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### **ì˜ˆì œ 2: ì´ìƒì¹˜ íƒìƒ‰ ë° ì²˜ë¦¬ (IQR í™œìš©)**

ğŸ“Œ **ë¬¸ì œ:** `titanic` ë°ì´í„°ì—ì„œ `fare` ì»¬ëŸ¼ì˜ ì´ìƒì¹˜ë¥¼ IQR ë°©ë²•ì„ ì‚¬ìš©í•˜ì—¬ íƒìƒ‰í•˜ì‹œì˜¤.

ğŸ’¡ **íŒíŠ¸:** ì´ìƒì¹˜ëŠ” **IQR(Interquartile Range)**ì„ ì´ìš©í•˜ì—¬ íƒìƒ‰í•  ìˆ˜ ìˆìŒ.

In [13]:
import numpy as np
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")
Q1 = df["fare"].quantile(0.25)
Q3 = df["fare"].quantile(0.75) # .quantile(0.25 / 0.5 / 0.75) í•¨ìˆ˜ë¥¼ í†µí•´ ì œ 1, 2, 3 ì‚¬ë¶„ìœ„ìˆ˜ë¥¼ êµ¬í•  ìˆ˜ ìˆìŒ
IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR
# ì´ìƒì¹˜ëŠ” ì œ1 ì‚¬ë¶„ìœ„ìˆ˜ë³´ë‹¤ IQRì˜ 1.5 ì´ìƒ ë°° ì‘ì€ ê°’ ë˜ëŠ” ì œ3 ì‚¬ë¶„ìœ„ìˆ˜ë³´ë‹¤ IQRì˜ 1.5ë°° ì´ìƒ í° ê°’

outliars = df[(df["fare"] < lower_bound) | (df["fare"] > upper_bound)]
# ë°ì´í„°í”„ë ˆì„[ì¡°ê±´1 | ì¡°ê±´2]ì˜ í˜•ì‹ì„ ì‚¬ìš©í•˜ë©´ ë‘ ê°€ì§€ ì¡°ê±´ ì¤‘ í•˜ë‚˜ë¥¼ ë§Œì¡±í•˜ëŠ” í–‰ì„ ì„ íƒí•  ìˆ˜ ìˆìŒ
print(outliars)

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
1           1       1  female  38.0      1      0   71.2833        C  First
27          0       1    male  19.0      3      2  263.0000        S  First
31          1       1  female   NaN      1      0  146.5208        C  First
34          0       1    male  28.0      1      0   82.1708        C  First
52          1       1  female  49.0      1      0   76.7292        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
846         0       3    male   NaN      8      2   69.5500        S  Third
849         1       1  female   NaN      1      0   89.1042        C  First
856         1       1  female  45.0      1      1  164.8667        S  First
863         0       3  female   NaN      8      2   69.5500        S  Third
879         1       1  female  56.0      0      1   83.1583        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
27     man        True    C  Southampton    no  False
31   woman       False    B    Cherbourg   yes  False
34     man        True  NaN    Cherbourg    no  False
52   woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
846    man        True  NaN  Southampton    no  False
849  woman       False    C    Cherbourg   yes  False
856  woman       False  NaN  Southampton   yes  False
863  woman       False  NaN  Southampton    no  False
879  woman       False    C    Cherbourg   yes  False

[116 rows x 15 columns]

### **ì˜ˆì œ 3: ë²”ì£¼í˜• ë³€ìˆ˜ ì›-í•« ì¸ì½”ë”© (One-Hot Encoding)**

ğŸ“Œ **ë¬¸ì œ:** `titanic` ë°ì´í„°ì—ì„œ `sex` ì»¬ëŸ¼ì„ ì›-í•« ì¸ì½”ë”©í•˜ì—¬ ìƒˆë¡œìš´ ë°ì´í„°í”„ë ˆì„ì„ ìƒì„±í•˜ì‹œì˜¤.

ğŸ’¡ **íŒíŠ¸:** `pd.get_dummies(df["sex"])`ë¥¼ ì‚¬ìš©í•˜ë©´ ì›-í•« ì¸ì½”ë”©ì„ ì ìš©í•  ìˆ˜ ìˆìŒ.

In [14]:
import seaborn as sns
import pandas as pd

df_encoded = pd.get_dummies(df["sex"])
print(df_encoded.head())

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

### **ì˜ˆì œ 4: Min-Max ìŠ¤ì¼€ì¼ë§ ì ìš©**

ğŸ“Œ **ë¬¸ì œ:** `titanic` ë°ì´í„°ì—ì„œ `fare` ì»¬ëŸ¼ì„ 0ê³¼ 1 ì‚¬ì´ ê°’ìœ¼ë¡œ ë³€í™˜í•˜ì‹œì˜¤.

ğŸ’¡ **íŒíŠ¸:** `MinMaxScaler()`ë¥¼ ì‚¬ìš©í•˜ë©´ ê°’ì„ 0~1 ì‚¬ì´ë¡œ ì¡°ì •í•  ìˆ˜ ìˆìŒ.

In [17]:
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler

df = sns.load_dataset("titanic")
scaler = MinMaxScaler()
df["fare_scaled"] = scaler.fit_transform(df[["fare"]])
# scaler.fit_transform(ë°ì´í„°í”„ë ˆì„[["ì—´"]]) í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•˜ë©´ í•´ë‹¹ ì—´ì˜ ê°’ì„ 0~1 ì‚¬ì´ì˜ ê°’ì„ ê°–ëŠ” ê°’ìœ¼ë¡œ ì¹˜í™˜í•  ìˆ˜ ìˆìŒ
print(df[["fare", "fare_scaled"]].head())

      fare  fare_scaled
0   7.2500     0.014151
1  71.2833     0.139136
2   7.9250     0.015469
3  53.1000     0.103644
4   8.0500     0.015713

### **ì˜ˆì œ 5: ìƒˆë¡œìš´ í”¼ì²˜ ìƒì„±í•˜ê¸° (ì´ ì§€ë¶ˆ ê¸ˆì•¡ ìƒì„±)**

ğŸ“Œ **ë¬¸ì œ:** `fare`ì™€ `tip`ì˜ í•©ì„ ìƒˆë¡œìš´ `total_payment` ì»¬ëŸ¼ìœ¼ë¡œ ì¶”ê°€í•˜ì‹œì˜¤.

ğŸ’¡ **íŒíŠ¸:** ìƒˆë¡œìš´ ì»¬ëŸ¼ì„ ìƒì„±í•  ë•Œ `df["ìƒˆë¡œìš´ ì»¬ëŸ¼"] = df["ì»¬ëŸ¼1"] + df["ì»¬ëŸ¼2"]` í˜•ì‹ì„ ì‚¬ìš©í•˜ë©´ ë¨.

In [21]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset("tips")
df["total_payment"] = df["total_bill"] + df["tip"]
# ë°ì´í„°í”„ë ˆì„["ìƒˆë¡œìš´ ì—´"] = ë°ì´í„°í”„ë ˆì„["ì—´1"] + ë°ì´í„°í”„ë ˆì„["ì—´2"] í˜¹ì€ ë‹¤ë¥¸ ì—°ì‚°ìë¥¼ ì‚¬ìš©í•˜ë©´ ìƒˆë¡œìš´ ì—´ì„ ë§Œë“¤ ìˆ˜ ìˆìŒ
df["ratio"] = df["tip"] / df["total_bill"]

print(df[["total_bill", "tip", "total_payment", "ratio"]])
# ì—¬ëŸ¬ ê°œì˜ ì—´ì„ ì„ íƒí•  ë•ŒëŠ” ëŒ€ê´„í˜¸ë¥¼ ë‘ ê°œ ì‚¬ìš©í•´ì•¼ í•¨

     total_bill   tip  total_payment     ratio
0         16.99  1.01          18.00  0.059447
1         10.34  1.66          12.00  0.160542
2         21.01  3.50          24.51  0.166587
3         23.68  3.31          26.99  0.139780
4         24.59  3.61          28.20  0.146808
..          ...   ...            ...       ...
239       29.03  5.92          34.95  0.203927
240       27.18  2.00          29.18  0.073584
241       22.67  2.00          24.67  0.088222
242       17.82  1.75          19.57  0.098204
243       18.78  3.00          21.78  0.159744

[244 rows x 4 columns]

1. **ê²°ì¸¡ì¹˜ë¥¼ ì¤‘ì•™ê°’(median)ìœ¼ë¡œ ì±„ìš°ê¸°**
    - `.fillna(df["ì»¬ëŸ¼ëª…"].median())`ì„ ì‚¬ìš©í•˜ì—¬ ê²°ì¸¡ì¹˜ë¥¼ ì¤‘ì•™ê°’ìœ¼ë¡œ ëŒ€ì²´í•˜ë¼.

In [27]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")
print(df.isnull().sum())

df["age"] = df["age"].fillna(df["age"].median())
print(df.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

2. **ì´ìƒì¹˜ë¥¼ ë¡œê·¸ ë³€í™˜(Log Transformation)í•˜ì—¬ ì²˜ë¦¬í•˜ê¸°**
    - `np.log1p(df["ì»¬ëŸ¼ëª…"])`ì„ ì‚¬ìš©í•˜ì—¬ ë¡œê·¸ ë³€í™˜ì„ ìˆ˜í–‰í•˜ë¼.

In [29]:
import numpy as np
import pandas as pd
import seaborn as sns

df = sns.load_dataset("tips")
df["total_bill_log"] = np.log1p(df["total_bill"])
# np.log1p(ë°ì´í„°í”„ë ˆì„["ì—´"]) í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ í•´ë‹¹ ì—´ì˜ ê°’ì„ ë¡œê·¸ ë³€í™˜í•  ìˆ˜ ìˆ
print(df[["total_bill", "total_bill_log"]].head())

   total_bill  total_bill_log
0       16.99        2.889816
1       10.34        2.428336
2       21.01        3.091497
3       23.68        3.205993
4       24.59        3.242202

3. **ë²”ì£¼í˜• ë³€ìˆ˜ Label Encoding ì ìš©í•˜ê¸°**
    - `LabelEncoder()`ë¥¼ ì‚¬ìš©í•˜ì—¬ ë²”ì£¼í˜• ë³€ìˆ˜ë¥¼ ìˆ«ìë¡œ ë³€í™˜í•˜ë¼.

In [45]:
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import LabelEncoder

df = sns.load_dataset("titanic")
print(df.head())

df["sex_encoded"] = LabelEncoder().fit_transform(df[["sex"]])
# LabelEncoder().fit_transform(ë°ì´í„°í”„ë ˆì„[["ì—´"]]) í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ í•´ë‹¹ ì—´ì˜ ë²”ì£¼í˜• ë³€ìˆ˜ë¥¼ ìˆ«ìë¡œ ë³€í™˜ ìˆ˜ ìˆìŒ

print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  sex_encoded
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            0
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

/usr/local/lib/python3.11/dist-packages/sklearn/preprocessing/_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

4. **í‘œì¤€í™”(Standardization) ì ìš©í•˜ê¸°**
    - `StandardScaler()`ë¥¼ ì‚¬ìš©í•˜ì—¬ í‰ê· ì´ 0, í‘œì¤€í¸ì°¨ê°€ 1ì´ ë˜ë„ë¡ ë³€í™˜í•˜ë¼.

In [43]:
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import StandardScaler

df = sns.load_dataset("tips")
df["total_bill_scaled"] = StandardScaler().fit_transform(df[["total_bill"]])
# StandardScaler().fit_transform(ë°ì´í„°í”„ë ˆì„[["ì—´"]])ì„ í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ í•´ë‹¹ ì—´ì˜ ê°’ì„ ì •ê·œë¶„í¬ë¡œ ë°”ê¿€ ìˆ˜ ìˆìŒ
print(df.head())

   total_bill   tip     sex smoker  day    time  size  total_bill_scaled
0       16.99  1.01  Female     No  Sun  Dinner     2          -0.314711
1       10.34  1.66    Male     No  Sun  Dinner     3          -1.063235
2       21.01  3.50    Male     No  Sun  Dinner     3           0.137780
3       23.68  3.31    Male     No  Sun  Dinner     2           0.438315
4       24.59  3.61  Female     No  Sun  Dinner     4           0.540745

5. **íŠ¹ì • ì»¬ëŸ¼ì„ ê¸°ì¤€ìœ¼ë¡œ ë°ì´í„° ì •ë ¬í•˜ê¸°**
    - `.sort_values(by="ì»¬ëŸ¼ëª…")`ì„ ì‚¬ìš©í•˜ì—¬ ë°ì´í„°ë¥¼ ì •ë ¬í•˜ë¼.

In [46]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset("tips")

print(df.sort_values(by = "total_bill"))
# .sort_values(by = "ì—´") í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ í•´ë‹¹ ì—´ì„ ê¸°ì¤€ìœ¼ë¡œ ë°ì´í„°í”„ë ˆì„ì„ ì •ë ¬í•  ìˆ˜ ìˆìŒ(ê¸°ë³¸ ì˜¤ë¦„ì°¨ìˆœ)

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
149        7.51   2.00    Male     No  Thur   Lunch     2
..          ...    ...     ...    ...   ...     ...   ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3
156       48.17   5.00    Male     No   Sun  Dinner     6
59        48.27   6.73    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

6. **ìƒˆë¡œìš´ ì»¬ëŸ¼ì„ ì¡°ê±´ì— ë”°ë¼ ìƒì„±í•˜ê¸°**
    - `df["new_col"] = df["age"].apply(lambda x: "Child" if x < 18 else "Adult")`ì„ ì‚¬ìš©í•˜ì—¬ ë‚˜ì´ì— ë”°ë¼ ë¶„ë¥˜í•˜ë¼.

In [47]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")

df["new_col"] = df["age"].apply(lambda x: "Child" if x < 18 else "Adult")
# df["ì—´"].apply(lambda x: "ì´ë¦„1" if x ì¡°ê±´ else"ì´ë¦„2") í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ ì¡°ê±´ì„ ë§Œì¡±í•  ê²½ìš° ì´ë¦„1, ê·¸ë ‡ì§€ ì•Šì„ ê²½ìš° ì´ë¦„2ë¡œ ì„¤ì •í•  ìˆ˜ ìˆìŒ

print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone new_col
0    man        True  NaN  Southampton    no  False   Adult
1  woman       False    C    Cherbourg   yes  False   Adult
2  woman       False  NaN  Southampton   yes   True   Adult
3  woman       False    C  Southampton   yes  False   Adult
4    man        True  NaN  Southampton    no   True   Adult

7. **ë°ì´í„°í”„ë ˆì„ì„ íŠ¹ì • ì¡°ê±´ìœ¼ë¡œ í•„í„°ë§í•˜ê¸°**
    - `df[df["fare"] > 50]`ì„ ì‚¬ìš©í•˜ì—¬ íŠ¹ì • ì¡°ê±´ì„ ë§Œì¡±í•˜ëŠ” ë°ì´í„°ë§Œ ì„ íƒí•˜ë¼.

In [48]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")

print(df[df["fare"] > 50])

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
1           1       1  female  38.0      1      0   71.2833        C  First
3           1       1  female  35.0      1      0   53.1000        S  First
6           0       1    male  54.0      0      0   51.8625        S  First
27          0       1    male  19.0      3      2  263.0000        S  First
31          1       1  female   NaN      1      0  146.5208        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
856         1       1  female  45.0      1      1  164.8667        S  First
863         0       3  female   NaN      8      2   69.5500        S  Third
867         0       1    male  31.0      0      0   50.4958        S  First
871         1       1  female  47.0      1      1   52.5542        S  First
879         1       1  female  56.0      0      1   83.1583        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
6      man        True    E  Southampton    no   True
27     man        True    C  Southampton    no  False
31   woman       False    B    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
856  woman       False  NaN  Southampton   yes  False
863  woman       False  NaN  Southampton    no  False
867    man        True    A  Southampton    no   True
871  woman       False    D  Southampton   yes  False
879  woman       False    C    Cherbourg   yes  False

[160 rows x 15 columns]

8. **ë°ì´í„° ìƒ˜í”Œë§ (ëœë¤ ìƒ˜í”Œ 10ê°œ ì„ íƒ)**
    - `.sample(n=10, random_state=42)`ì„ ì‚¬ìš©í•˜ì—¬ 10ê°œì˜ ëœë¤ ìƒ˜í”Œì„ ì„ íƒí•˜ë¼.

In [67]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")

df_sampled = df.sample(n=10, random_state=42)
# .sample(n=ìˆ«ì, random_state=ì‹œë“œ) í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•˜ë©´ ì›í•˜ëŠ” ìˆ«ìì˜ ì—´ì„ ë¬´ì‘ìœ„ë¡œ ì¶”ì¶œí•  ìˆ˜ ìˆìŒ(ì‹œë“œë¥¼ ì ìœ¼ë©´ í•­ìƒ ê°™ì€ ê²°ê³¼ê°€ ì¶œë ¥ë¨)
print(df_sampled)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
709         1       3    male   NaN      1      1  15.2458        C   Third
439         0       2    male  31.0      0      0  10.5000        S  Second
840         0       3    male  20.0      0      0   7.9250        S   Third
720         1       2  female   6.0      0      1  33.0000        S  Second
39          1       3  female  14.0      1      0  11.2417        C   Third
290         1       1  female  26.0      0      0  78.8500        S   First
300         1       3  female   NaN      0      0   7.7500        Q   Third
333         0       3    male  16.0      2      0  18.0000        S   Third
208         1       3  female  16.0      0      0   7.7500        Q   Third
136         1       1  female  19.0      0      2  26.2833        S   First

       who  adult_male deck  embark_town alive  alone
709    man        True  NaN    Cherbourg   yes  False
439    man        True  NaN  Southampton    no   True
840    man        True  NaN  Southampton    no   True
720  child       False  NaN  Southampton   yes  False
39   child       False  NaN    Cherbourg   yes  False
290  woman       False  NaN  Southampton   yes   True
300  woman       False  NaN   Queenstown   yes   True
333    man        True  NaN  Southampton    no  False
208  woman       False  NaN   Queenstown   yes   True
136  woman       False    D  Southampton   yes  False

9. **ì¤‘ë³µëœ í–‰ ì œê±°í•˜ê¸°**
    - `.drop_duplicates()`ì„ ì‚¬ìš©í•˜ì—¬ ì¤‘ë³µ ë°ì´í„°ë¥¼ ì œê±°í•˜ë¼.

In [73]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset("titanic")

df.info()

df_no_duplicates = df.drop_duplicates()
# .drop_duplicates() í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ ì¤‘ë³µë˜ëŠ” í–‰ì„ ì§€ìš¸ ìˆ˜ ìˆìŒ

df_no_duplicates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
<class 'pandas.core.frame.DataFrame'>
Index: 784 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     784 non-null    int64
 1   pclass       784 non-null    int64
 2   sex          784 non-null    object
 3   age          678 non-null    float64
 4   sibsp        784 non-null    int64
 5   parch        784 non-null    int64
 6   fare         784 non-null    float64
 7   embarked     782 non-null    object
 8   class        784 non-null    category
 9   who          784 non-null    object
 10  adult_male   784 non-null    bool
 11  deck         202 non-null    category
 12  embark_town  782 non-null    object
 13  alive        784 non-null    object
 14  alone        784 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 77.0+ KB

10. **ê²°ì¸¡ì¹˜ê°€ í¬í•¨ëœ í–‰ ì œê±°í•˜ê¸°**
- `.dropna()`ë¥¼ ì‚¬ìš©í•˜ì—¬ ê²°ì¸¡ì¹˜ê°€ í¬í•¨ëœ í–‰ì„ ì‚­ì œí•˜ë¼.

In [74]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")

df_no_missing = df.dropna()
# .dropna() í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ë©´ ê²°ì¸¡ì¹˜ê°€ í¬í•¨ëœ í–‰ì„ ì „ë¶€ ì—†ì•¨ ìˆ˜ ìˆìŒ

df.info()
df_no_missing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
<class 'pandas.core.frame.DataFrame'>
Index: 182 entries, 1 to 889
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     182 non-null    int64
 1   pclass       182 non-null    int64
 2   sex          182 non-null    object
 3   age          182 non-null    float64
 4   sibsp        182 non-null    int64
 5   parch        182 non-null    int64
 6   fare         182 non-null    float64
 7   embarked     182 non-null    object
 8   class        182 non-null    category
 9   who          182 non-null    object
 10  adult_male   182 non-null    bool
 11  deck         182 non-null    category
 12  embark_town  182 non-null    object
 13  alive        182 non-null    object
 14  alone        182 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 18.2+ KB